In [1]:
from cmath import isnan

import pandas as pd

# Creating a DataFrame Manually
a Dataframe is basically a table that aloows us tu like work with different document types like csv and organize data in a well mannered way

In [9]:
dataframe=pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,10,11,12]])
print(dataframe)

   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

You can also name the rows
Index define what names would the row name be, originally they are number starting from 0

In [10]:
dataframe=pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,10,11,12]],index=["A","B","C"])
print(dataframe)

   0   1   2   3
A  1   2   3   4
B  5   6   7   8
C  9  10  11  12

You can also name the coloumns which is more preffered and is done by using the coloumn

In [11]:
dataframe=pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,10,11,12]],columns=["A","B","C","D"])
print(dataframe)

   A   B   C   D
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

# Loading Data from CSV and exporting Data to csv

In [122]:
dataframe=pd.read_csv("../Files/Assignment2/coffee.csv")
dataframe

    Unnamed: 0        Day Coffee Type  Units Sold
0            0     Monday    Espresso          25
1            1     Monday       Latte          15
2            2    Tuesday    Espresso          30
3            3    Tuesday       Latte          20
4            4  Wednesday    Espresso          35
5            5  Wednesday       Latte          25
6            6   Thursday    Espresso          40
7            7   Thursday       Latte          30
8            8     Friday    Espresso          45
9            9     Friday       Latte          35
10          10   Saturday    Espresso          45
11          11   Saturday       Latte          35
12          12     Sunday    Espresso          45
13          13     Sunday       Latte          35

In [43]:
content.to_csv("../Files/Assignment2/coffee.csv")

# Overwrites the file at this path with the changes

# Accessing Data

.dtypes= gives us the info of the datatypes of each coloumn

In [44]:
dataframe.dtypes

Unnamed: 0     int64
Day              str
Coffee Type      str
Units Sold     int64
dtype: object

.info= gives us the info of the datatypes, memory usage and no of unique values of each coloumn

In [45]:
dataframe.info()

<class 'pandas.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   14 non-null     int64
 1   Day          14 non-null     str
 2   Coffee Type  14 non-null     str
 3   Units Sold   14 non-null     int64
dtypes: int64(2), str(2)
memory usage: 580.0 bytes

.describe= gives us the info of the mean, count minimum value and so on
 of each coloumn

In [46]:
dataframe.describe()

       Unnamed: 0  Units Sold
count     14.0000   14.000000
mean       6.5000   32.857143
std        4.1833    9.346798
min        0.0000   15.000000
25%        3.2500   26.250000
50%        6.5000   35.000000
75%        9.7500   38.750000
max       13.0000   45.000000

In [47]:
dataframe.shape

(14, 4)

.Unique= we can use .unique to find the unique values throughout the table or finding unique values inside a specific coloumn

In [48]:
dataframe.nunique()

Unnamed: 0     14
Day             7
Coffee Type     2
Units Sold      7
dtype: int64

In [51]:
dataframe["Units Sold"].unique()

# works only on numbers

array([25, 15, 30, 20, 35, 40, 45])

In [52]:
dataframe

    Unnamed: 0        Day Coffee Type  Units Sold
0            0     Monday    Espresso          25
1            1     Monday       Latte          15
2            2    Tuesday    Espresso          30
3            3    Tuesday       Latte          20
4            4  Wednesday    Espresso          35
5            5  Wednesday       Latte          25
6            6   Thursday    Espresso          40
7            7   Thursday       Latte          30
8            8     Friday    Espresso          45
9            9     Friday       Latte          35
10          10   Saturday    Espresso          45
11          11   Saturday       Latte          35
12          12     Sunday    Espresso          45
13          13     Sunday       Latte          35

Accessing vlaues using loc and iloc
loc=dataframe_name[rows,coloumns]

iloc=dataframe_name[rows,coloumns]

difference= in loc we get by like index name and so on like we can do loc[["A","B"]] but in iloc this will give error and we have to give index like [0,1]

In [53]:
dataframe.loc[[0,1,2],["Day","Coffee Type","Units Sold"]]

# Take rows 1,2,3 from Day,Coffee Type,Units Sold

       Day Coffee Type  Units Sold
0   Monday    Espresso          25
1   Monday       Latte          15
2  Tuesday    Espresso          30

In [54]:
dataframe.loc[1:5,:]

#spilicing: taking data of from 1 to 5 rows and all coloumns

   Unnamed: 0        Day Coffee Type  Units Sold
1           1     Monday       Latte          15
2           2    Tuesday    Espresso          30
3           3    Tuesday       Latte          20
4           4  Wednesday    Espresso          35
5           5  Wednesday       Latte          25

In [58]:
dataframe.iloc[1:5,[1,2,3]]

         Day Coffee Type  Units Sold
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

# Sort

In [60]:
dataframe.sort_values("Units Sold",ascending=True)

#if ascending = false then in descending order , if true then ofcourse in ascending order

    Unnamed: 0        Day Coffee Type  Units Sold
1            1     Monday       Latte          15
3            3    Tuesday       Latte          20
0            0     Monday    Espresso          25
5            5  Wednesday       Latte          25
2            2    Tuesday    Espresso          30
7            7   Thursday       Latte          30
4            4  Wednesday    Espresso          35
9            9     Friday       Latte          35
11          11   Saturday       Latte          35
13          13     Sunday       Latte          35
6            6   Thursday    Espresso          40
8            8     Friday    Espresso          45
10          10   Saturday    Espresso          45
12          12     Sunday    Espresso          45

In [72]:
dataframe.sort_values(["Units Sold","Coffee Type"], ascending=(0,1))

# sort first based on coffee type but if two rows have same coffee type sort by units sold,, 0 in ascending means that for coffee type do not sort by ascending and 1 means that sort by ascending

    Unnamed: 0        Day Coffee Type  Units Sold
8            8     Friday    Espresso          45
10          10   Saturday    Espresso          45
12          12     Sunday    Espresso          45
6            6   Thursday    Espresso          40
4            4  Wednesday    Espresso          35
9            9     Friday       Latte          35
11          11   Saturday       Latte          35
13          13     Sunday       Latte          35
2            2    Tuesday    Espresso          30
7            7   Thursday       Latte          30
0            0     Monday    Espresso          25
5            5  Wednesday       Latte          25
3            3    Tuesday       Latte          20
1            1     Monday       Latte          15

# Working with series
making a series which is basically a one d array that represent a single coloumn

creating a series

series=pd.Series([1,2,3,4,5,6])


mathemtaical functions
| Operation          | How
| ------------------ | ------------
| Sum                | `s.sum()`
| Mean / Average     | `s.mean()`
| Median             | `s.median()`
| Min                | `s.min()`
| Max                | `s.max()`
| Standard Deviation | `s.std()`
| Count (non-NA)     | `s.count()`

conditions
series[series>5]

In [64]:
series=pd.Series([2,3,4,5,6,7,8,9])

In [65]:
series.sum()

np.int64(44)

In [68]:
series.max()

np.int64(9)

In [69]:
series=series+2
series

0     4
1     5
2     6
3     7
4     8
5     9
6    10
7    11
dtype: int64

In [70]:
series[series>6]

3     7
4     8
5     9
6    10
7    11
dtype: int64

# Filtering complex Data

In [73]:
olympic= pd.read_csv("../Files/Assignment2/olympicData.csv")

In [84]:
olympic.loc[(olympic['height_cm'] >25 )& (olympic["name"].str.contains("keith",case=False)), ["name"]].head(5)

# show rows with height greater tha 25 , name containing keith and only the name coloumn and take the first 5 results

                 name
3505    Keith Wallace
6228    Keith Hartley
16166  Keith Reynolds
18734  Keith Sinclair
19812   Keith Thomson

# Adding Removing Coloumns

adding a simple column

In [88]:
dataframe["price"]=4.99

# creates a new coloumn and make its value 4.99 for all rows

    Unnamed: 0        Day Coffee Type  Units Sold  price
0            0     Monday    Espresso          25   4.99
1            1     Monday       Latte          15   4.99
2            2    Tuesday    Espresso          30   4.99
3            3    Tuesday       Latte          20   4.99
4            4  Wednesday    Espresso          35   4.99
5            5  Wednesday       Latte          25   4.99
6            6   Thursday    Espresso          40   4.99
7            7   Thursday       Latte          30   4.99
8            8     Friday    Espresso          45   4.99
9            9     Friday       Latte          35   4.99
10          10   Saturday    Espresso          45   4.99
11          11   Saturday       Latte          35   4.99
12          12     Sunday    Espresso          45   4.99
13          13     Sunday       Latte          35   4.99

adding a new coloumn and for each row having seperate values based on condition

if more than two options like here it was espresso and latte but if more

dataframe["new_price"] = np.where(
    dataframe["Coffee Type"] == "Espresso", 3.99,
    np.where(dataframe["Coffee Type"] == "Latte", 4.99, 5.99)
)

In [90]:
import numpy as np
dataframe["new_price"]= np.where(dataframe["Coffee Type"]=="Espresso",3.99,5.99)
dataframe

    Unnamed: 0        Day Coffee Type  Units Sold  price  new_price
0            0     Monday    Espresso          25   4.99       3.99
1            1     Monday       Latte          15   4.99       5.99
2            2    Tuesday    Espresso          30   4.99       3.99
3            3    Tuesday       Latte          20   4.99       5.99
4            4  Wednesday    Espresso          35   4.99       3.99
5            5  Wednesday       Latte          25   4.99       5.99
6            6   Thursday    Espresso          40   4.99       3.99
7            7   Thursday       Latte          30   4.99       5.99
8            8     Friday    Espresso          45   4.99       3.99
9            9     Friday       Latte          35   4.99       5.99
10          10   Saturday    Espresso          45   4.99       3.99
11          11   Saturday       Latte          35   4.99       5.99
12          12     Sunday    Espresso          45   4.99       3.99
13          13     Sunday       Latte          35   4.99       5.99

Removing a coloumns using drop

In [91]:
dataframe=dataframe.drop(columns=["price"])

In [92]:
dataframe

    Unnamed: 0        Day Coffee Type  Units Sold  new_price
0            0     Monday    Espresso          25       3.99
1            1     Monday       Latte          15       5.99
2            2    Tuesday    Espresso          30       3.99
3            3    Tuesday       Latte          20       5.99
4            4  Wednesday    Espresso          35       3.99
5            5  Wednesday       Latte          25       5.99
6            6   Thursday    Espresso          40       3.99
7            7   Thursday       Latte          30       5.99
8            8     Friday    Espresso          45       3.99
9            9     Friday       Latte          35       5.99
10          10   Saturday    Espresso          45       3.99
11          11   Saturday       Latte          35       5.99
12          12     Sunday    Espresso          45       3.99
13          13     Sunday       Latte          35       5.99

making new coloumn based on some mathematical operations

In [93]:
dataframe["revenue"]=dataframe['Units Sold']* dataframe['new_price']
dataframe

    Unnamed: 0        Day Coffee Type  Units Sold  new_price  revenue
0            0     Monday    Espresso          25       3.99    99.75
1            1     Monday       Latte          15       5.99    89.85
2            2    Tuesday    Espresso          30       3.99   119.70
3            3    Tuesday       Latte          20       5.99   119.80
4            4  Wednesday    Espresso          35       3.99   139.65
5            5  Wednesday       Latte          25       5.99   149.75
6            6   Thursday    Espresso          40       3.99   159.60
7            7   Thursday       Latte          30       5.99   179.70
8            8     Friday    Espresso          45       3.99   179.55
9            9     Friday       Latte          35       5.99   209.65
10          10   Saturday    Espresso          45       3.99   179.55
11          11   Saturday       Latte          35       5.99   209.65
12          12     Sunday    Espresso          45       3.99   179.55
13          13     Sunday       Latte          35       5.99   209.65

renaming a column

In [96]:
dataframe=dataframe.rename(columns={'new_price':'price'})
dataframe

    Unnamed: 0        Day Coffee Type  Units Sold  price  revenue
0            0     Monday    Espresso          25   3.99    99.75
1            1     Monday       Latte          15   5.99    89.85
2            2    Tuesday    Espresso          30   3.99   119.70
3            3    Tuesday       Latte          20   5.99   119.80
4            4  Wednesday    Espresso          35   3.99   139.65
5            5  Wednesday       Latte          25   5.99   149.75
6            6   Thursday    Espresso          40   3.99   159.60
7            7   Thursday       Latte          30   5.99   179.70
8            8     Friday    Espresso          45   3.99   179.55
9            9     Friday       Latte          35   5.99   209.65
10          10   Saturday    Espresso          45   3.99   179.55
11          11   Saturday       Latte          35   5.99   209.65
12          12     Sunday    Espresso          45   3.99   179.55
13          13     Sunday       Latte          35   5.99   209.65

Making a new column using some string functions
eg here we will make a new column for first name in the olympic data

In [97]:
olympic["firstName"]=olympic["name"].str.split(" ").str[0]
olympic.head(10)

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,firstName
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-Franois
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert
5,6,Nicolas Chatelain,1970-01-13,Amiens,Somme,FRA,France,181.0,70.0,NaN,Nicolas
6,7,Patrick Chila,1969-11-27,Ris-Orangis,Essonne,FRA,France,180.0,73.0,NaN,Patrick
7,8,Henri Cochet,1901-12-14,Villeurbanne,Rhne,FRA,France,NaN,NaN,1987-04-02,Henri
8,9,Marcel Cousin,1896-08-04,Nmes,Gard,FRA,France,NaN,NaN,1986-08-01,Marcel
9,10,Guy de la Chapelle,1868-07-16,Farges-Allichamps,Cher,FRA,France,NaN,NaN,1923-08-27,Guy

converting to a datetimeformat

In [98]:
olympic["birthDateinDateFormat"]= pd.to_datetime(olympic["born_date"])
olympic

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,firstName,birthDateinDateFormat
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-Franois,1886-12-12
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,1969-04-01
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,1898-08-13
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,1895-05-11
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,1878-04-17
...,...,...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN,Polina,2002-01-30
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN,Valeriya,1999-09-20
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN,Yuliya,1998-05-08
145498,149225,Andr Foussard,1899-05-19,Niort,Deux-Svres,FRA,France,166.0,NaN,1986-03-18,Andr,1899-05-19
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,Bill,1913-07-15

making a borh year column

In [99]:
olympic["born_year"]=olympic['birthDateinDateFormat'].dt.year
olympic

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,firstName,birthDateinDateFormat,born_year
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-Franois,1886-12-12,1886.0
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,1969-04-01,1969.0
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,1898-08-13,1898.0
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,1895-05-11,1895.0
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,1878-04-17,1878.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN,Polina,2002-01-30,2002.0
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN,Valeriya,1999-09-20,1999.0
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN,Yuliya,1998-05-08,1998.0
145498,149225,Andr Foussard,1899-05-19,Niort,Deux-Svres,FRA,France,166.0,NaN,1986-03-18,Andr,1899-05-19,1899.0
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,Bill,1913-07-15,1913.0

Use of lambda Function

In [100]:
olympic["Height Category"]= olympic['height_cm'].apply(lambda x:'short' if x < 165 else('average' if x<185 else 'Tall'))
olympic

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,firstName,birthDateinDateFormat,born_year,Height Category
0,1,Jean-Franois Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Jean-Franois,1886-12-12,1886.0,Tall
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,Arnaud,1969-04-01,1969.0,average
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrnes-Atlantiques,FRA,France,183.0,76.0,1994-07-17,Jean,1898-08-13,1898.0,average
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,Jacques,1895-05-11,1895.0,average
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Albert,1878-04-17,1878.0,Tall
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN,Polina,2002-01-30,2002.0,average
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN,Valeriya,1999-09-20,1999.0,average
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN,Yuliya,1998-05-08,1998.0,short
145498,149225,Andr Foussard,1899-05-19,Niort,Deux-Svres,FRA,France,166.0,NaN,1986-03-18,Andr,1899-05-19,1899.0,average
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,Bill,1913-07-15,1913.0,Tall

In [107]:


dataframe['Coffee Type']=dataframe['Coffee Type'].str.lower()
dataframe

    Unnamed: 0        Day Coffee Type  Units Sold
0            0     Monday    espresso          25
1            1     Monday       latte          15
2            2    Tuesday    espresso          30
3            3    Tuesday       latte          20
4            4  Wednesday    espresso          35
5            5  Wednesday       latte          25
6            6   Thursday    espresso          40
7            7   Thursday       latte          30
8            8     Friday    espresso          45
9            9     Friday       latte          35
10          10   Saturday    espresso          45
11          11   Saturday       latte          35
12          12     Sunday    espresso          45
13          13     Sunday       latte          35

# Handling Missing Values

In [125]:
dataframe.loc[[1,2],"Units Sold"]=np.nan

In [127]:
dataframe

    Unnamed: 0        Day Coffee Type  Units Sold
0            0     Monday    Espresso        25.0
1            1     Monday       Latte         NaN
2            2    Tuesday    Espresso         NaN
3            3    Tuesday       Latte        20.0
4            4  Wednesday    Espresso        35.0
5            5  Wednesday       Latte        25.0
6            6   Thursday    Espresso        40.0
7            7   Thursday       Latte        30.0
8            8     Friday    Espresso        45.0
9            9     Friday       Latte        35.0
10          10   Saturday    Espresso        45.0
11          11   Saturday       Latte        35.0
12          12     Sunday    Espresso        45.0
13          13     Sunday       Latte        35.0

filling it a general value using fillna

In [113]:
dataframe["Units Sold"]=dataframe["Units Sold"].fillna(1000)
dataframe

    Unnamed: 0        Day Coffee Type  Units Sold
0            0     Monday    espresso        25.0
1            1     Monday       latte      1000.0
2            2    Tuesday    espresso      1000.0
3            3    Tuesday       latte        20.0
4            4  Wednesday    espresso        35.0
5            5  Wednesday       latte        25.0
6            6   Thursday    espresso        40.0
7            7   Thursday       latte        30.0
8            8     Friday    espresso        45.0
9            9     Friday       latte        35.0
10          10   Saturday    espresso        45.0
11          11   Saturday       latte        35.0
12          12     Sunday    espresso        45.0
13          13     Sunday       latte        35.0

fill it mean of that coloumn

In [116]:
dataframe["Units Sold"]=dataframe["Units Sold"].fillna(dataframe["Units Sold"].mean())
dataframe

    Unnamed: 0        Day Coffee Type  Units Sold
0            0     Monday    espresso   25.000000
1            1     Monday       latte   34.583333
2            2    Tuesday    espresso   34.583333
3            3    Tuesday       latte   20.000000
4            4  Wednesday    espresso   35.000000
5            5  Wednesday       latte   25.000000
6            6   Thursday    espresso   40.000000
7            7   Thursday       latte   30.000000
8            8     Friday    espresso   45.000000
9            9     Friday       latte   35.000000
10          10   Saturday    espresso   45.000000
11          11   Saturday       latte   35.000000
12          12     Sunday    espresso   45.000000
13          13     Sunday       latte   35.000000

using interpolate such that it finds the like relation uptill that point and does accordingly,, cannot work for firstrow

In [129]:
dataframe["Units Sold"]=dataframe["Units Sold"].interpolate()
dataframe

    Unnamed: 0        Day Coffee Type  Units Sold
0            0     Monday    Espresso   25.000000
1            1     Monday       Latte   23.333333
2            2    Tuesday    Espresso   21.666667
3            3    Tuesday       Latte   20.000000
4            4  Wednesday    Espresso   35.000000
5            5  Wednesday       Latte   25.000000
6            6   Thursday    Espresso   40.000000
7            7   Thursday       Latte   30.000000
8            8     Friday    Espresso   45.000000
9            9     Friday       Latte   35.000000
10          10   Saturday    Espresso   45.000000
11          11   Saturday       Latte   35.000000
12          12     Sunday    Espresso   45.000000
13          13     Sunday       Latte   35.000000

we can also delete if a specific column has nan values

In [120]:
dataframe.dropna(subset=["Units Sold"], inplace=True)
dataframe

    Unnamed: 0        Day Coffee Type  Units Sold
0            0     Monday    espresso        25.0
3            3    Tuesday       latte        20.0
4            4  Wednesday    espresso        35.0
5            5  Wednesday       latte        25.0
6            6   Thursday    espresso        40.0
7            7   Thursday       latte        30.0
8            8     Friday    espresso        45.0
9            9     Friday       latte        35.0
10          10   Saturday    espresso        45.0
11          11   Saturday       latte        35.0
12          12     Sunday    espresso        45.0
13          13     Sunday       latte        35.0

Getting rows that have a nan value and dont have an nan value

In [128]:
dataframe[dataframe["Units Sold"].isna()]

   Unnamed: 0      Day Coffee Type  Units Sold
1           1   Monday       Latte         NaN
2           2  Tuesday    Espresso         NaN

In [131]:
dataframe[dataframe["Units Sold"].notna()]

    Unnamed: 0        Day Coffee Type  Units Sold
0            0     Monday    Espresso   25.000000
1            1     Monday       Latte   23.333333
2            2    Tuesday    Espresso   21.666667
3            3    Tuesday       Latte   20.000000
4            4  Wednesday    Espresso   35.000000
5            5  Wednesday       Latte   25.000000
6            6   Thursday    Espresso   40.000000
7            7   Thursday       Latte   30.000000
8            8     Friday    Espresso   45.000000
9            9     Friday       Latte   35.000000
10          10   Saturday    Espresso   45.000000
11          11   Saturday       Latte   35.000000
12          12     Sunday    Espresso   45.000000
13          13     Sunday       Latte   35.000000